---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPair.#ctor(System.Int32,System.Int32)
source: html/963c3eef-600e-4f25-8b66-69338651b249.htm
---
# Autodesk.Revit.DB.VertexIndexPair.#ctor Method

Initializes a new instance of the VertexIndexPair class

## Syntax (C#)
```csharp
public VertexIndexPair(
	int iTop,
	int iBottom
)
```

## Parameters
- **iTop** (`System.Int32`)
- **iBottom** (`System.Int32`)